---
kind: method
id: M:Autodesk.Revit.DB.Analysis.FieldDomainPointsByParameter.#ctor(System.Collections.Generic.IList{System.Double})
source: html/c8a3997a-c4fa-97e0-54f0-2d756e33ff84.htm
---
# Autodesk.Revit.DB.Analysis.FieldDomainPointsByParameter.#ctor Method

Creates object from an array of one-dimensional point coordinates

## Syntax (C#)
```csharp
public FieldDomainPointsByParameter(
	IList<double> points
)
```

## Parameters
- **points** (`System.Collections.Generic.IList < Double >`) - Array of one-dimensional point coordinates representing domain points (using raw parameters when on a curve)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null